In [1]:
import pandas as pd

In [13]:
df = pd.read_csv('Book1.csv')
df

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
4   2014    NaN
5   2015   82.0
6   2016   93.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Class   10 non-null     int64
 1   Marks   9 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 288.0 bytes

In [15]:
df1 = df.dropna()

In [8]:
df1

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
5   2015   82.0
6   2016   93.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [18]:
df.fillna(88,inplace=True)

In [19]:
df

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
4   2014   88.0
5   2015   82.0
6   2016   93.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [20]:
df['Marks'].mean()

89.0

In [21]:
df['Marks'].median()

89.0

In [22]:
df['Marks'].mode()

0    89.0
1    92.0
2    93.0
Name: Marks, dtype: float64

In [26]:
df.drop_duplicates()

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
4   2014   88.0
5   2015   82.0
6   2016   93.0
7   2017   92.0
8   2018   93.0
9   2019   92.0